/* 
Задача 54: Задайте двумерный массив. Напишите программу, 
которая упорядочит по убыванию элементы каждой строки двумерного массива.


*/


void PrintArray(int[,] matr) // метод, который печатает массив
{
    for (int i = 0; i < matr.GetLength(0); i++)
    {
        for (int j = 0; j < matr.GetLength(1); j++)
        {
            Console.Write($"{matr[i, j]} ");
        }
        Console.WriteLine();
    }
}

void FillArray(int[,] matr) // метод, который заполняет массив случайными числами от 1 до 9
{
    for (int i = 0; i < matr.GetLength(0); i++)
    {
        for (int j = 0; j < matr.GetLength(1); j++)
        {
            matr[i, j] = new Random().Next(1, 10); // [1,10)
        }
    }
}

void ArraySort(int[,] array) //метод, который упорядочивает элементы каждой строки по убыванию
{
    int temp;
    for (int i = 0; i < array.GetLength(0); i++)
    {

        for (int j = 0; j < array.GetLength(1); j++)
        {
            for (int k = j + 1; k < array.GetLength(1); k++)
            {
                if (array[i, j] < array[i, k])
                {
                    temp = array[i, k];
                    array[i, k] = array[i, j];
                    array[i, j] = temp;

                }
            }
        }
    }
}

int[,] matrix = new int[3, 4];
Console.WriteLine("Исходнная матрица: ");
FillArray(matrix);
PrintArray(matrix);
Console.WriteLine();
Console.WriteLine("Полученная матрица: ");
ArraySort(matrix);
PrintArray(matrix);